EnergyMicro/EFM32GG_STK3700/examples/lightsense/lightsense.c
  /* Check the current mode of the application. */
  if (appModeGlobal == MODE0)
  {
    /* Increase the event counter... */
    eventCounter++;
    /* ...and go to INIT_STATE. */
    appStateGlobal = INIT_STATE;
  }
  else if (appModeGlobal == MODE1)
  {
    /* LESENSE interrupts only enabled in EM0 in order to keep the MCU
     * awake on every sensor event.
     * Go to RESET_STATE to reset the timeout timer. */
    appStateGlobal = TIMER_RESET_STATE;
  }
  else
  {
    appStateGlobal = ERROR_STATE;
  }
}


/**************************************************************************//**
 * @brief  PCNT interrupt handler
 *****************************************************************************/
void PCNT0_IRQHandler(void)
{
  /* Overflow interrupt on PCNT0. */
  PCNT_IntClear(PCNT0, PCNT_IF_OF);

  /* Only applies to MODE1. */
  if (appModeGlobal == MODE1)
  {
    /* Increase the counter with the number of events that triggered the PCNT
     * overflow. */
    eventCounter += LIGHTSENSE_NUMOF_EVENTS;
    /* Go to INIT_STATE. */
    appStateGlobal = INIT_STATE;
  }
}


/**************************************************************************//**
 * @brief  RTC common interrupt handler
 *****************************************************************************/
void RTC_IRQHandler(void)
{
  uint32_t tmp;


  /* Store enabled interrupts in temp variable. */
  tmp = RTC->IEN;

  /* Check if COMP0 interrupt is enabled and set. */
  if (RTC_IF_COMP0 & (tmp & RTC_IntGet()))
  {
    /* Timer has fired, clear interrupt flag... */
    RTC_IntClear(RTC_IFC_COMP0);
    /* ...and set the global flag. */
    secTimerFired = true;
  }
}


/**************************************************************************//**
 * @brief  GPIO even interrupt handler (for handling button events)
 *****************************************************************************/
void GPIO_ODD_IRQHandler(void)
{
  /* Clear interrupt flag */
  GPIO_IntClear(LIGHTSENSE_BUTTON0_FLAG);

  /* Change the mode */
  if (appModeGlobal == MODE0 )
  {
    appModeGlobal = MODE1;
  }
  else
  {
    appModeGlobal = MODE0;
  }

  /* Put the application to BUTTON_PRESS state. */
  appStateGlobal = BUTTON0_PRESS_STATE;
}


